Tekla.Structures.Dialog.StructuresInstallation
Utility functions.

Tekla.Structures.Dialog.StructuresInstallation.BinFolder
Gets Path to Tekla Structures binary (bin) directory.

Tekla.Structures.Dialog.StructuresInstallation.EnvBaseFolder
Gets Path to Tekla Structures XSDATADIR directory. XSDATADIR is defined in the teklastructures.ini file.
It points to a location, where the installation installs the environment files and folders. Example: C:\ProgramData\Trimble\Tekla Structures\Version

Tekla.Structures.Dialog.StructuresInstallation.InstallFolder
Gets path to Tekla Structures installation directory.

Tekla.Structures.Dialog.StructuresInstallation.MessageFolder
Gets path to Tekla Structures messages directory.

Tekla.Structures.Dialog.StructuresInstallation.MessagesFolder
Gets a list Paths to Tekla Structures messages directories.

Tekla.Structures.Dialog.StructuresInstallation.GetLocalizationFile(System.String,System.String)
Retrieves localization file from configured environment
subPath: Possible sub folder of message file. Empty sub folder has no effect.
messageFile: File name of message file.
Returns: localization file full path

Tekla.Structures.Dialog.StructuresInstallation.GetLocalizationFile(System.String)
Retrieves localization file from configured environment
messageFile: File name of message file.
Returns: Localization file full path